Tekla.Structures.DrawingInternal.ScopedCDelegateSetter
Can be used for scoped settings of ICDelegate.

Tekla.Structures.DrawingInternal.ScopedCDelegateSetter.#ctor(Tekla.Structures.DrawingInternal.ICDelegate)
Construct scoped setter and set the DelegateProxy.Delegate to what is provided for constructor.
deleg:

Tekla.Structures.DrawingInternal.ScopedCDelegateSetter.Dispose
Restores the DelegateProxy.Delegate to what it was before this class was constructed.